app/Controllers/Locales.php

SELECT *
FROM `local`
---
public function visualizar()
{
    $session = session();
    $localModel = new Local();

    if ($session->has('selected_local')) {
        $localId = $session->get('selected_local');
        $local = $localModel->find($localId);

        return view('local/vista', ['locales' => [$local], 'selected' => true]);
    }

    $locales = $localModel->findAll();