app/Controllers/ProductoController.php

    public function index()
    {
        $session = session();
        if($session->get('logged_in')!=true || $session->get('tipo')!=1){
            return redirect()->to(base_url('/login'));
        }
        $productoM = model('ProductoModel');
        $data['producto'] = $productoM->select('producto.*, categoria.nombreCategoria, local.nombreLocal')
            ->join('categoria', 'categoria.idCategoria = producto.idCategoria', 'left')
            ->join('local', 'local.idLocal = producto.idLocal', 'left')
            ->findAll();
---
SELECT `producto`.*, `categoria`.`nombreCategoria`, `local`.`nombreLocal`
FROM `producto`
LEFT JOIN `categoria` ON `categoria`.`idCategoria` = `producto`.`idCategoria`
LEFT JOIN `local` ON `local`.`idLocal` = `producto`.`idLocal`

    public function add()
    {
        $session = session();
        if($session->get('logged_in')!=true || $session->get('tipo')!=1){
            return redirect()->to(base_url('/login'));
        }
        $categoriaModel = new CategoriaM();
        $localModel = new Local();

        $categorias = $categoriaModel->findAll();
        $locales = $localModel->findAll();
---
SELECT *
FROM `categoria`
SELECT *
FROM `local`

    public function edit($idProducto)
    {
        $session = session();
        if($session->get('logged_in')!=true || $session->get('tipo')!=1){
            return redirect()->to(base_url('/login'));
        }
        $productoModel = new ProductoModel();
        $categoriaModel = new CategoriaM();
        $localModel = new Local();


        $producto = $productoModel->select('producto.*, categoria.nombreCategoria, local.nombreLocal')
                                ->join('categoria', 'categoria.idCategoria = producto.idCategoria', 'left')
                                ->join('local', 'local.idLocal = producto.idLocal', 'left')
                                ->where('producto.idProducto', $idProducto)
                                ->get()
                                ->getRowArray();

        if (!$producto) {
            return redirect()->to('/productos');
        }


        $data = [
            'producto' => $producto,
            'categorias' => $categoriaModel->asArray()->findAll(),
            'locales' => $localModel->asArray()->findAll(),
---
SELECT `producto`.*, `categoria`.`nombreCategoria`, `local`.`nombreLocal`
FROM `producto`
LEFT JOIN `categoria` ON `categoria`.`idCategoria` = `producto`.`idCategoria`
LEFT JOIN `local` ON `local`.`idLocal` = `producto`.`idLocal`
WHERE `producto`.`idProducto` = '59'
SELECT *
FROM `categoria`
SELECT *
FROM `local`

    public function visualizar()
{
    $session = session();


    if (!$session->has('selected_local')) {
        return view('producto/vista', ['productos' => [], 'localSeleccionado' => false]);
    }

    $idLocal = $session->get('selected_local');

    $productoModel = new ProductoModel();
    $categoriaModel = new CategoriaM();


    $productos = $productoModel->where('idLocal', $idLocal)->findAll();


    foreach ($productos as &$producto) {

        $categoria = $categoriaModel->find($producto->idCategoria);
---
SELECT *
FROM `producto`
WHERE `idLocal` = '11'
SELECT *
FROM `categoria`
WHERE `categoria`.`idCategoria` = '12'

    public function inicioAdmin()
{

    $session = session();
        if($session->get('logged_in')!=true || $session->get('tipo')!=1){
            return redirect()->to(base_url('/login'));
        }
    $productoModel = new ProductoModel();
    $categoriaModel = new CategoriaM();
    $localModel = new Local();

    $productos = $productoModel->findAll();

    $umbralStockBajo = 5;
    $alertas = [];

    foreach ($productos as $producto) {
        if ($producto->stock <= $umbralStockBajo) {
            $categoria = $categoriaModel->find($producto->idCategoria);

            $local = $localModel->find($producto->idLocal);
---
SELECT *
FROM `producto`
SELECT *
FROM `categoria`
WHERE `categoria`.`idCategoria` = '16'
SELECT *
FROM `local`
WHERE `local`.`idLocal` = '8'